WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read from FIFO via I2C (single byte)
 *
 * As shown in timing diagram 11.2.4, FIFO read operations read data directly
 * from the FIFO without specifying a register address.
 */
static int wk2132_i2c_read_fifo(FAR struct wk2132_dev_s *priv, FAR uint8_t *value)
{
  struct i2c_msg_s msg;
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, FIFO access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, true);

  /* Setup I2C read message - direct data read from FIFO as per timing diagram */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = I2C_M_READ;
  msg.buffer    = value;
  msg.length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Set baud rate for a UART port
 * Based on DFRobot implementation with fractional calculation
 */
static int wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud)
{
  uint16_t val_integer, val_decimal;
  uint8_t baud1, baud0, pres;
  uint8_t scr_backup, clear = 0x00;
  int ret;

  syslog(LOG_DEBUG, "WK2132: Setting baud rate to %lu\n", (unsigned long)baud);

  /* Save SCR register before modifying baud rate */
  ret = wk2132_i2c_read_reg(priv, WK2132_SCR, &scr_backup);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to read SCR register\n");
      return ret;
    }

  /* Clear SCR to disable TX/RX during baud rate change */
  ret = wk2132_i2c_write_reg(priv, WK2132_SCR, clear);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to clear SCR register\n");
      return ret;
    }

  /* DFRobot algorithm:
   * val_integer = FOSC/(baud * 16) - 1
   * val_decimal = (FOSC%(baud * 16))/(baud * 16) * 10 (for prescaler calculation)
   * Prescaler is calculated from decimal part
   */
  val_integer = (WK2132_CRYSTAL_FREQ / (baud * 16)) - 1;
  /* Calculate decimal part more accurately by scaling */
  uint32_t remainder = WK2132_CRYSTAL_FREQ % (baud * 16);
  val_decimal = (remainder * 10) / (baud * 16);

  /* Extract high and low bytes */
  baud1 = (uint8_t)(val_integer >> 8);
  baud0 = (uint8_t)(val_integer & 0x00FF);

  /* Calculate prescaler from decimal part */
  while (val_decimal > 0x0A)
    {
      val_decimal /= 0x0A;
    }
  pres = (uint8_t)val_decimal;

  syslog(LOG_DEBUG, "WK2132: Baud calculation - FOSC=%d, baud=%lu\n",
         WK2132_CRYSTAL_FREQ, (unsigned long)baud);
  syslog(LOG_DEBUG, "WK2132: val_integer=%u, val_decimal=%u, pres=%u\n",
         val_integer, val_decimal, pres);
  syslog(LOG_DEBUG, "WK2132: Setting BAUD1=0x%02x, BAUD0=0x%02x, PRES=0x%02x\n",
         baud1, baud0, pres);

  /* Select sub-page 1 for baud rate configuration */
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* Set baud rate registers */
  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD1, baud1);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD0, baud0);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_PRES, pres);
  if (ret < 0)
    {
      return ret;
    }

  /* Read back the baud rate registers for verification */
  uint8_t verify_baud1, verify_baud0, verify_pres;
  ret = wk2132_i2c_read_reg(priv, WK2132_BAUD1, &verify_baud1);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to verify BAUD1 register for port %d\n", priv->port);
      goto errout;
    }

  ret = wk2132_i2c_read_reg(priv, WK2132_BAUD0, &verify_baud0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to verify BAUD0 register for port %d\n", priv->port);
      goto errout;
    }

  ret = wk2132_i2c_read_reg(priv, WK2132_PRES, &verify_pres);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to verify PRES register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Verified BAUD1=0x%02x, BAUD0=0x%02x, PRES=0x%02x\n",
         verify_baud1, verify_baud0, verify_pres);

  /* Return to sub-page 0 */
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);
  if (ret < 0)
    {
      return ret;
    }

  /* Restore SCR register to re-enable TX/RX */
  ret = wk2132_i2c_write_reg(priv, WK2132_SCR, scr_backup);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to restore SCR register\n");
      return ret;
    }

  syslog(LOG_DEBUG, "WK2132: Baud rate %lu set successfully, SCR restored to 0x%02x\n",
         (unsigned long)baud, scr_backup);

  return ret;

errout:
  /* Try to restore state on error */
  wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);  /* Return to page 0 */
  wk2132_i2c_write_reg(priv, WK2132_SCR, scr_backup);  /* Restore SCR */
  return ret;
}

/**
 * @brief Polling worker function
 */
static void wk2132_poll_worker(FAR void *arg)
{
  int i;
  bool should_continue;

  /* Poll all registered devices */
  for (i = 0; i < g_wk2132_device_count; i++)
    {
      FAR struct uart_dev_s *dev = g_wk2132_devices[i];
      if (dev != NULL)
        {
          FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

          /* Only poll enabled devices */
          if (priv->enabled)
            {
              /* Check for received data */
              if (wk2132_rxavailable(dev))
                {
                  uart_recvchars(dev);
                }

              /* Check for transmit ready */
              if (dev->xmit.head != dev->xmit.tail && wk2132_txready(dev))
                {
                  uart_xmitchars(dev);
                }
            }
        }
    }

  /* Check if we should continue polling (with proper synchronization) */
  nxsem_wait(&g_wk2132_poll_sem);
  should_continue = g_wk2132_poll_started;
  nxsem_post(&g_wk2132_poll_sem);

  /* Schedule next poll */
  if (should_continue)
    {
      work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL,
                 MSEC2TICK(1));  /* Poll every 1ms */
    }
}

/**
 * @brief Setup UART port
 * Based on DFRobot subSerialConfig implementation
 */
static int wk2132_setup(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t lcr = 0;
  uint8_t gena, grst, gier;
  int ret;

  syslog(LOG_INFO, "WK2132: Setting up port %d\n", priv->port);

  /* Take exclusive access */
  ret = nxsem_wait(&priv->exclsem);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to get exclusive access for port %d\n", priv->port);
      return ret;
    }

  /* Step 1: Sub UART clock enable (DFRobot: subSerialGlobalRegEnable(subUartChannel, clock)) */
  syslog(LOG_DEBUG, "WK2132: Sub UART clock enable for port %d\n", priv->port);
  ret = wk2132_i2c_read_global(priv, WK2132_GENA, &gena);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to read GENA register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Current GENA=0x%02x for port %d\n", gena, priv->port);

  /* Enable the UART port in global register */
  uint8_t gena_bit = 1 << (priv->port - 1);
  gena |= gena_bit;
  ret = wk2132_i2c_write_global(priv, WK2132_GENA, gena);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write GENA register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Enabled clock for port %d in GENA, new value=0x%02x\n", priv->port, gena);

  /* Allow clock to stabilize */
  usleep(10000);  /* 10ms delay */

  /* Step 2: Software reset sub UART (DFRobot: subSerialGlobalRegEnable(subUartChannel, rst)) */
  syslog(LOG_DEBUG, "WK2132: Software reset sub UART for port %d\n", priv->port);
  ret = wk2132_i2c_read_global(priv, WK2132_GRST, &grst);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to read GRST register for port %d\n", priv->port);
      goto errout;
    }

  uint8_t grst_bit = 1 << (priv->port - 1);
  grst |= grst_bit;
  ret = wk2132_i2c_write_global(priv, WK2132_GRST, grst);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write GRST register for port %d\n", priv->port);
      goto errout;
    }

