WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  ret = wk2132_i2c_write_reg(priv, WK2132_SCR, scr);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write SCR register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Set SCR=0x%02x for port %d (RX/TX enabled)\n", scr, priv->port);

  /* Allow final configuration to settle */
  usleep(10000);  /* 10ms delay */

  syslog(LOG_INFO, "WK2132: Setup completed successfully for port %d\n", priv->port);

  /* Start polling if not already started (with proper synchronization) */
  nxsem_wait(&g_wk2132_poll_sem);
  if (!g_wk2132_poll_started)
    {
      g_wk2132_poll_started = true;
      ret = work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL, 0);
      if (ret < 0)
        {
          syslog(LOG_ERR, "WK2132: Failed to start polling worker: %d\n", ret);
          g_wk2132_poll_started = false;  /* Reset on failure */
          nxsem_post(&g_wk2132_poll_sem);
          goto errout;
        }
      syslog(LOG_INFO, "WK2132: Started global polling\n");
    }
  nxsem_post(&g_wk2132_poll_sem);

  /* Mark device as enabled only after everything succeeds */
  priv->enabled = true;

errout:
  nxsem_post(&priv->exclsem);
  return ret;
}

/**
 * @brief Shutdown UART port
 */
static void wk2132_shutdown(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t gena;
  int i;
  bool any_enabled = false;

  /* Mark device as disabled first */
  priv->enabled = false;

  /* Disable all interrupts */
  wk2132_i2c_write_reg(priv, WK2132_SIER, 0x00);

  /* Disable the UART port in global register */
  if (wk2132_i2c_read_global(priv, WK2132_GENA, &gena) >= 0)
    {
      uint8_t gena_bit = 1 << (priv->port - 1);
      gena &= ~gena_bit;
      wk2132_i2c_write_global(priv, WK2132_GENA, gena);
    }

  /* Check if any devices are still enabled */
  nxsem_wait(&g_wk2132_poll_sem);
  for (i = 0; i < g_wk2132_device_count; i++)
    {
      if (g_wk2132_devices[i] != NULL)
        {
          FAR struct wk2132_dev_s *check_priv =
            (FAR struct wk2132_dev_s *)g_wk2132_devices[i]->priv;
          if (check_priv->enabled)
            {
              any_enabled = true;
              break;
            }
        }
    }

  /* If no devices are enabled, stop polling */
  if (!any_enabled && g_wk2132_poll_started)
    {
      g_wk2132_poll_started = false;
      work_cancel(LPWORK, &g_wk2132_poll_work);
      syslog(LOG_INFO, "WK2132: Stopped global polling - no devices enabled\n");
    }
  nxsem_post(&g_wk2132_poll_sem);
}

/**
 * @brief Attach interrupt (not used in polled mode)
 */
static int wk2132_attach(FAR struct uart_dev_s *dev)
{
  return OK;
}

/**
 * @brief Detach interrupt (not used in polled mode)
 */
static void wk2132_detach(FAR struct uart_dev_s *dev)
{
  /* Nothing to do */
}

/**
 * @brief IOCTL handler
 */
static int wk2132_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct uart_dev_s *dev = inode->i_private;
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret = OK;

  switch (cmd)
    {
    case TCGETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Return current settings */
        termiosp->c_cflag = 0;

        /* WK2132 only supports 8-bit data according to datasheet */
        termiosp->c_cflag |= CS8;

        if (priv->stopbits2)
          {
            termiosp->c_cflag |= CSTOPB;
          }

        if (priv->parity == 1)
          {
            termiosp->c_cflag |= PARENB | PARODD;
          }
        else if (priv->parity == 2)
          {
            termiosp->c_cflag |= PARENB;
          }

        /* Set baud rate */
        cfsetispeed(termiosp, priv->baud);
        cfsetospeed(termiosp, priv->baud);
      }
      break;

    case TCSETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Extract new settings */
        priv->baud = cfgetispeed(termiosp);

        /* WK2132 only supports 8-bit data according to datasheet */
        priv->nbits = 8;

        priv->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        /* Reconfigure the UART */
        ret = wk2132_setup(dev);
        if (ret < 0)
          {
            syslog(LOG_ERR, "WK2132: Failed to reconfigure UART port %d: %d\n", priv->port, ret);
            /* On setup failure, we should still return the error but the device remains usable with old settings */
          }
      }
      break;

    default:
      ret = -ENOTTY;
      break;
    }

  return ret;
}

/**
 * @brief Receive character
 */
static int wk2132_receive(FAR struct uart_dev_s *dev, unsigned int *status)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;
  uint8_t lsr;
  uint8_t rxdata;
  int ret;

  /* Check if device is enabled */
  if (!priv->enabled)
    {
      *status = 0;
      return -EIO;
    }

  /* Get FIFO status */
  ret = wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to read FSR for port %d: %d\n", priv->port, ret);
      *status = 0;
      return -EIO;
    }

  /* Check if data is actually available before reading */
  if ((fsr & WK2132_FSR_RDAT) == 0)
    {
      syslog(LOG_DEBUG, "WK2132: No data available in RX FIFO for port %d\n", priv->port);
      *status = fsr << 8;
      return -EAGAIN;  /* No data available */
    }

  /* Get line status */
  ret = wk2132_i2c_read_reg(priv, WK2132_LSR, &lsr);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to read LSR for port %d: %d\n", priv->port, ret);
      *status = fsr << 8;
      return -EIO;
    }

  *status = (fsr << 8) | lsr;

