WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Read data from FIFO */
  ret = wk2132_i2c_read_fifo(priv, &rxdata);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to read RX FIFO for port %d: %d\n", priv->port, ret);
      return -EIO;
    }

  return rxdata;
}

/**
 * @brief Enable/disable RX interrupt
 */
static void wk2132_rxint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;
  int ret;

  /* Check if device is enabled */
  if (!priv->enabled)
    {
      return;
    }

  /* Read current interrupt enable register */
  ret = wk2132_i2c_read_reg(priv, WK2132_SIER, &sier);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to read SIER for port %d: %d\n", priv->port, ret);
      return;
    }

  /* Enable/disable RX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_RFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_RFTRIG_IEN;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to write SIER for port %d: %d\n", priv->port, ret);
    }
}

/**
 * @brief Check if RX data available
 */
static bool wk2132_rxavailable(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register for available data */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  return (fsr & WK2132_FSR_RDAT) != 0;
}

/**
 * @brief Send character
 */
static void wk2132_send(FAR struct uart_dev_s *dev, int ch)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret;

  /* Check if device is enabled */
  if (!priv->enabled)
    {
      return;
    }

  /* Write data to FIFO */
  ret = wk2132_i2c_write_fifo(priv, (uint8_t)ch);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to send character 0x%02x to port %d: %d\n",
             (uint8_t)ch, priv->port, ret);
    }
}

/**
 * @brief Enable/disable TX interrupt
 */
static void wk2132_txint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;
  int ret;

  /* Check if device is enabled */
  if (!priv->enabled)
    {
      return;
    }

  /* Read current interrupt enable register */
  ret = wk2132_i2c_read_reg(priv, WK2132_SIER, &sier);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to read SIER for port %d: %d\n", priv->port, ret);
      return;
    }

  /* Enable/disable TX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_TFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_TFTRIG_IEN;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
  if (ret < 0)
    {
      syslog(LOG_WARNING, "WK2132: Failed to write SIER for port %d: %d\n", priv->port, ret);
    }
}

/**
 * @brief Check if TX ready
 */
static bool wk2132_txready(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX FIFO is not full */
  return (fsr & WK2132_FSR_TFULL) == 0;
}

/**
 * @brief Check if TX empty
 */
static bool wk2132_txempty(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return true;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX is not busy and no data available */
  return ((fsr & WK2132_FSR_TBUSY) == 0) && ((fsr & WK2132_FSR_TDAT) == 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/**
 * @brief Initialize a WK2132 UART port
 */
FAR struct uart_dev_s *wk2132_uart_init(FAR struct i2c_master_s *i2c,
                                         uint8_t base_addr, uint8_t port)
{
  FAR struct wk2132_dev_s *priv;
  FAR struct uart_dev_s *dev;
  int ret;

  /* Enable debug logging for WK2132 driver */
  setlogmask(LOG_UPTO(LOG_DEBUG));

  syslog(LOG_INFO, "WK2132: Initializing port %d with base_addr 0x%02x\n", port, base_addr);

  /* Validate parameters */
  if (!i2c || port < 1 || port > WK2132_MAX_PORTS)
    {
      syslog(LOG_ERR, "WK2132: Invalid parameters - i2c=%p, port=%d (valid range 1-%d)\n",
             i2c, port, WK2132_MAX_PORTS);
      return NULL;
    }

  /* Allocate device structures */
  priv = (FAR struct wk2132_dev_s *)kmm_zalloc(sizeof(struct wk2132_dev_s));
  if (priv == NULL)
    {
      syslog(LOG_ERR, "WK2132: Failed to allocate private structure for port %d\n", port);
      return NULL;
    }

  syslog(LOG_DEBUG, "WK2132: Allocated private structure for port %d\n", port);

  dev = (FAR struct uart_dev_s *)kmm_zalloc(sizeof(struct uart_dev_s));
  if (dev == NULL)
    {
      syslog(LOG_ERR, "WK2132: Failed to allocate uart_dev_s structure for port %d\n", port);
      kmm_free(priv);
      return NULL;
    }

  syslog(LOG_DEBUG, "WK2132: Allocated uart_dev_s structure for port %d\n", port);

  /* Initialize private structure */
  priv->i2c       = i2c;
  priv->base_addr = base_addr;
  priv->port      = port;
  priv->baud      = 115200;  /* Default baud rate */
  priv->parity    = 0;       /* No parity */
  priv->nbits     = 8;       /* 8 data bits */
  priv->stopbits2 = false;   /* 1 stop bit */
  priv->enabled   = false;

  nxsem_init(&priv->exclsem, 0, 1);

  syslog(LOG_DEBUG, "WK2132: Initialized private structure - port=%d, baud=%lu, bits=%lu\n",
         priv->port, (unsigned long)priv->baud, priv->nbits);

  /* Initialize public structure */
  dev->ops      = &g_wk2132_uart_ops;
  dev->priv     = priv;
  dev->isconsole = false;

  /* Allocate RX/TX buffers */
  dev->xmit.size   = 32;
  dev->xmit.buffer = (FAR char *)kmm_malloc(dev->xmit.size);
  if (dev->xmit.buffer == NULL)
    {
      syslog(LOG_ERR, "WK2132: Failed to allocate TX buffer for port %d\n", port);
      goto errout;
    }

